<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>MyBBoard.de - Deutsches Sprachpaket &quot;formell&quot;</title>
<style type="text/css">
  <!--
  body,td,th {
    font-family: "Trebuchet MS", Verdana, Arial, Helvetica, sans-serif;
     font-size: 13px;
     color: #333333;
  }

  body {
     background: #efefef;
     text-align: center;
     margin: 0px;
     padding: 0px;
  }

  a:link {
     color: #900000;
     text-decoration: none;
  }

  a:visited {
     text-decoration: none;
     color: #900000;
  }

  a:hover {
     text-decoration: underline;
     color: #333333;
  }

  a:active {
     text-decoration: underline;
     color: #333333;
  }

  #container {
     width: 900px;
     margin: auto auto;
     text-align: left;
     background: #ffffff;
     border-left: 2px solid #cccccc;
     border-right: 2px solid #cccccc;
  }

  #header {
     width: 890px;
     padding: 5px;
     color: #ffffff;
     background: #990000;
     font-size: 14px;
  }

  #header h1 {
    font-size: 30px;
    font-weight: bold;
    padding: 0px;
    margin: 0px;
    color: #ffffff;
  }

  #header h2 {
    font-size: 20px;
    font-weight: bold;
    padding: 0px;
    margin: 0px;
    color: #ffffff;
  }

  #content {
     width: 840px;
     padding: 30px;
     text-align: justify;
     line-height: 1.7;
  }

  h1 {
     font-size: 20px;
     font-family: "Segoe UI", "Century Gothic", Verdana, Arial, Helvetica, sans-serif;
     color: #900000;
     font-weight: bold;
     padding: 0px;
     margin: 6px 0px;
  }

  .file {
     color: #009900;
     font-weight: bold;
  }
  -->
</style>
</head>
<body>

<a name="top" id="top"></a>

<div id="container">

<div id="header">
    <h1>MyBBoard.de - Deutsches Sprachpaket &quot;formell&quot;</h1>
    <h2>Readme</h2>
    Version: x.x.x
</div>

<div id="content">

<em>Dieses Sprachpaket wurde erstellt f&uuml;r <strong>MyBulletinBoard x.x.x</strong>. Wenn Sie eine neuere Version des MyBulletinBoards verwenden, sollten Sie nachsehen, ob ein daf&uuml;r vorgesehenes Sprachpaket zur Verf&uuml;gung steht; gehen Sie dazu auf <a href="http://www.mybboard.de" target="_blank">MyBBoard.de</a></em>.

<br />
<br />

<h1>Inhalt</h1>
1. <a href="#a1">Einleitung</a><br />
2. <a href="#a2">Installation</a><br />
3. <a href="#a3">Update</a><br />
4. <a href="#a4">Benutzung</a><br />
5. <a href="#a5">Einstellungen</a><br />
6. <a href="#a6">&Auml;nderungen</a><br />
7. <a href="#a7">Weitere Hinweise</a><br />
8. <a href="#a8">Lizenz / Nutzungsbedingungen</a><br />

<br />

<a name="a1" id="a1"></a><h1>1. Einleitung</h1>
Sie haben sich daf&uuml;r entschieden, MyBulletinBoard als Forensoftware zu verwenden. Wir m&ouml;chten uns f&uuml;r Ihre Wahl bedanken und hoffen, dass Sie mit der Software zufrieden sind.
<br />
<br />
Damit m&ouml;glichst viele Nutzer MyBulletinBoard verwenden k&ouml;nnen, ist das Forum mehrsprachenf&auml;hig. Standardm&auml;&szlig;ig wird MyBulletinBoard mit englischer Sprache installiert, aber dank vieler Freiwilliger, ist das MyBulletinBoard auch in anderen Sprachen erh&auml;ltlich. Dieses Sprachpaket erlaubt es Ihnen, MyBulletinBoard auf Deutsch zu betreiben.
<br />
<div align="right"><a href="#top">Nach oben</a></div>

<br />

<a name="a2" id="a2"></a><h1>2. Installation</h1>
Der deutsche Text ist in Dateien gespeichert, die Sie im Ordner &quot;Sprachdateien&quot; finden. Die deutschen Standardbuttons befinden sich im Ordner &quot;Buttons&quot;.
<br />
<br />
Im Folgenden wird in einzelnen Schritten beschrieben, wie Sie vorgehen m&uuml;ssen, um das Sprachpaket zu installieren.
<br />
<ol>
    <li>&Ouml;ffnen Sie Ihr FTP-Programm und stellen Sie eine Verbindung mit Ihrem Server her.
    <br />
    <br />
    </li>
    <li>&Ouml;ffnen Sie den Ordner, in den Sie MyBulletinBoard installiert haben.
    <br />
    <br />
    </li>
    <li>&Ouml;ffnen Sie den Ordner <span class="file">inc</span> und darin den Ordner <span class="file">languages</span>.
    <br />
    <br />
    </li>
    <li>Kopieren Sie die Datei <span class="file">deutsch_sie.php</span> und den Ordner <span class="file">deutsch_sie</span> aus dem Ordner &quot;Sprachdateien&quot; in den Ordner <span class="file">languages</span> auf dem Server.
    <br />
    <br />
    </li>
    <li>Gehen Sie zur&uuml;ck in den Ordner, in den Sie MyBulletinBoard installiert haben.
    <br />
    <br />
    </li>
    <li>&Ouml;ffnen Sie den Ordner <span class="file">images</span>.
    <br />
    <br />
    </li>
    <li>Kopieren Sie den Ordner <span class="file">deutsch_sie</span> aus dem Ordner &quot;Buttons&quot; in den Ordner <span class="file">images</span> auf dem Server.
    </li>
</ol>
Sie haben nun alle erforderlichen Dateien auf den Server &uuml;bertragen. Im folgenden Absatz wird beschrieben, wie Sie Ihr Forum auf das neue Sprachpaket umstellen k&ouml;nnen.
<br />
<div align="right"><a href="#top">Nach oben</a></div>

<br />

<a name="a3" id="a3"></a><h1>3. Update</h1>
Seit der letzten Version der Sprachdateien (1.4.x) gab es gro&szlig;e &Auml;nderungen. Daher ist es erforderlich alle Dateien zu aktualisieren.
<div align="right"><a href="#top">Nach oben</a></div>

<br />

<a name="a4" id="a4"></a><h1>4. Benutzung</h1>
Nachdem Sie alle erforderlichen Dateien auf den Server &uuml;bertragen haben, k&ouml;nnen Sie das Sprachpaket f&uuml;r Ihr MyBulletinBoard verwenden. Hier erfahren Sie, wie Sie die deutsche Sprache f&uuml;r das Forum und/oder das Admin Control-Panel einsetzen und wie Sie die deutsche &Uuml;bersetzung als Standardsprache einstellen. Die Standardsprache wird f&uuml;r G&auml;ste und registrierte Mitglieder verwendet, die keine Sprachauswahl getroffen haben.
<ul>
    <li>Um die deutsche &Uuml;bersetzung im Forum zu benutzen, muss ein Benutzer in seinem Control-Panel unter &quot;Optionen &auml;ndern&quot;/&quot;Edit Options&quot; die Sprache &quot;Deutsch&quot; ausw&auml;hlen.
    <br />
    <br />
    </li>
    <li>Um die deutsche &Uuml;bersetzung auf den Administrationsbereich anzuwenden, m&uuml;ssen Sie sich im Admin-CP anmelden. Gehen Sie in die &quot;Konfiguration&quot;. Unter &quot;Control Panel-Einstellungen&quot;/&quot;Control Panel Preferences (Global)&quot; k&ouml;nnen Sie die Sprache &auml;ndern.
    <br />
    <br />
    </li>
    <li>Um die deutsche &Uuml;bersetzung als Standard-Sprache f&uuml;r Ihr Forum zu setzen, m&uuml;ssen Sie sich im Admin-CP anmelden. Gehen Sie in die &quot;Konfiguration&quot;. Unter &quot;Allgemeine Konfiguration&quot;/&quot;Global Configuration&quot; k&ouml;nnen Sie &quot;Deutsch&quot; als Standard-Sprache w&auml;hlen.
    </li>
</ul>
<div align="right"><a href="#top">Nach oben</a></div>

<br />

<a name="a5" id="a5"></a><h1>5. Einstellungen</h1>
Wenn Sie das Board auf deutsch betreiben, werden im Folgenden Einstellungen erl&auml;utert, die angepasst werden sollten. Die Einstellungen finden Sie im Admin-CP unter &quot;Foreneinstellungen&quot; -&gt; &quot;&Auml;ndern&quot;.
<br />
<br />
<strong>Allgemeine Konfiguration</strong>
<ul>
    <li>Dezimalpunkt: &quot;,&quot; (Komma)
    <br />
    <br />
    </li>
    <li>Tausendertrennung: &quot;.&quot; (Punkt)</li>
</ul>
<strong>Datums- und Zeitformat</strong>
<ul>
    <li>Datumsformat: &quot;d.m.Y&quot;
    <br />
    <br />
    </li>
    <li>Zeitformat: &quot;H:i&quot;
    <br />
    <br />
    </li>
    <li>Zeitzone: &quot;+1&quot;
    </li>
</ul>
Desweiteren empfiehlt sich die &Uuml;bersetzung der Profilfelder (&quot;Benutzer und Gruppen&quot; -&gt; &quot;Profilfelder&quot;) und der Benutzergruppen (&quot;Benutzer und Gruppen&quot; -&gt; &quot;Gruppen verwalten&quot;).
<br />
<div align="right"><a href="#top">Nach oben</a></div>

<br />

<a name="a6" id="a6"></a><h1>6. &Auml;nderungen</h1>
Im Folgenden finden Sie die &Auml;nderungen seit dem Sprachpaket f&uuml;r MyBulletinBoard 1.4.x.
<ul>
    <li>&Uuml;bersetzung neuer Sprachvariablen
    <br />
    <br />
    </li>
    <li>Die &Uuml;bersetzung einzelner Begriffe wurde verbessert und angeglichen
    <br />
    <br />
    </li>
    <li>Verschiedene Grammatik- und Syntax-Fehler wurden korrigiert
    <br />
    <br />
    </li>
    <li>Verbesserungsvorschl&auml;ge von Benutzern wurden aufgenommen
    <br />
    <br />
    </li>
</ul>
Dar&uuml;ber hinaus wurden weitere Korrekturen vorgenommen, die die &Uuml;bersetzung deutlich verbessern, jedoch nicht auf den ersten Blick ersichtlich sind.
<br />
<div align="right"><a href="#top">Nach oben</a></div>

<br />

<a name="a7" id="a7"></a><h1>7. Hinweise </h1>
MyBulletinBoard ist ein relativ junges Softwarepaket. Die Unterst&uuml;tzung von mehreren Sprachen existiert erst seit kurzem, deshalb kann die &Uuml;bersetzung noch kleinere Fehler beinhalten. Wir bitten Sie deshalb, Fehler auf <a href="http://www.mybboard.de" target="_blank">MyBBoard.de</a> zu melden. Ihre Meldungen/Kommentare sind ein wichtiger Bestandteil zur Verbesserung der &Uuml;bersetzung!
<br />
<br />
Ein besonderer Dank gilt allen Beta-Testern, die bei der Verbesserung des Sprachpakets geholfen haben!
<br />
<br />
<strong>Wir w&uuml;nschen Ihnen viel Spa&szlig; und Erfolg mit dem MyBulletinBoard!</strong>
<br />
<div align="right"><a href="#top">Nach oben</a></div>

<br />

<a name="a8" id="a8"></a><h1>8. Lizenz / Nutzungsbedingungen</h1>
Das Copyright f&uuml;r die Sprachpakete liegt bei <a href="http://www.mybboard.de" target="_blank">MyBBoard.de</a>. Die Copyrighthinweise in den Sprachdateien d&uuml;rfen nicht ge&auml;ndert oder entfernt werden. Sie d&uuml;rfen die Sprachdateien und Buttons kostenlos benutzen.
<br />
<br />
Wenn Sie unsere Arbeit unterst&uuml;tzen m&ouml;chten, gehen Sie bitte auf <a href="http://www.mybboard.de/impressum/unterstuetzung.html" target="_blank">diese Seite</a>.
<br />
<div align="right"><a href="#top">Nach oben</a></div>

<br />

<div style="text-align: center; font-weight: bold;">2005 - 2009 &copy; <a href="http://www.mybboard.de" target="_blank">MyBBoard.de</a></div>

</div>

</div>

</body>
</html>
